
 {
  "id": "100",
  "imgg": "https://www.whiskaffair.com/wp-content/uploads/2020/09/Oats-Idli-1.jpg",
  "namee": "Oats Idli",
  "ratingg": 8.8,
  "ingredients": [
   "2 cups oats",
    "tbsp oil ",
    "1 tsp mustard seeds",
    "1 tsp chana dal",
    "1 tsp urad dal",
   "1 tsp/2 tsp turmeric  powder",
   "1 Green chilli",
   "1 cup carrot  finely chopped",
   "1/2 cupcoriander leaves chopped ", 
   "pinch of salt","For Idli Batter:1/2 tsp salt","2 cups curdA pinch of fruit salt"
 ],
  "contentt": "These easy oats idli are light, fluffy, cakes perfect for a quick Breakfast or healthy on-the-go Snack. Made with oats, curd (yogurt), semolina, herbs and spices, this instant oats idli recipe requires no fermentation and is quick to prepare."
  ,"method":"For Oats Powder:1.Take 2 cups of oats in a pan and dry roast them for about 5 minutes until golden brown.2.Let it cool down and then grind to make it a powder.For Fried Mixture:1.In a broad pan heat oil over medium flame.2.Add mustard seeds to it and let them crackle.3.Now add chana and urad Dal, turmeric powder and green chillis. Mix well and saute until light brown.4.Add the chopped carrots and coriander leaves. Combine all the ingredients thoroughly along with a pinch of salt and cook for a minute or two.5.Let the mixture cool down for few minutes before adding into idli batter.For Idli Batter:1.Transfer the prepared oats powder to a large bowl.2.In this add salt and the fried mixture. Combine well.3.Now add the required quantity of curd and stir thoroughly in one direction adding a pinch of fruit salt to it.4.Prepare a medium thick batter and leave it covered for few minutes.5.Now grease the idli moulds with ghee using a brush.6.Pour the prepared oats idli batter in each mould and put it in the steamer.7.Cover with a lid and steam for about 15 minutes over medium flame.8.After 15 minutes check whether the idlis are properly cooked.9.The tasty and healthy oats idli is ready to serve with coconut chutney."
 }
 
 
 



 
  
